Revit 2026 API

# DuctSizeSettingIteratorCurrent Property

---

Gets the item at the current position of the iterator.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual KeyValuePair<DuctShape, DuctSizes> Current { get; }
```
```vb
Public Overridable ReadOnly Property Current As KeyValuePair(Of DuctShape, DuctSizes)
	Get
```
```cpp
public:
virtual property KeyValuePair<DuctShape, DuctSizes^> Current {
	KeyValuePair<DuctShape, DuctSizes^> get ();
}
```
```fsharp
abstract Current : KeyValuePair<DuctShape, DuctSizes> with get
override Current : KeyValuePair<DuctShape, DuctSizes> with get
```

#### Property Value

KeyValuePairDuctShape, DuctSizes

#### Implements

IEnumeratorTCurrent

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

There is no current item if the iterator has not started yet or has been done.

#### Reference

DuctSizeSettingIterator Class

Autodesk.Revit.DB.Mechanical Namespace